//          Задача 1: 
//              Не верна - после каждого значения должна стоять запятая.
        // const userInfo = {
        //     names: "Вася",
        //     age: 30
        // }

        // console.log(userInfo);

/////////////////////////////////////////////////////////////////////////////////////////

//      Задача 2:
//              Код написан верно (так как ключ это строка и черес кавычки мы можем написать любое название).

        // let userInfo2 = {
        //     names: "Вася",
        //     age: 30,
        //     "58": "Значение свойства"
        // }

        // console.log(userInfo2[58]);

////////////////////////////////////////////////////////////////////////////////////////

//      Задача 3:
//           В консоли будет 45 (так как мы пепеприсвоили значение)

        // let userInfo3 = {
        //     names: "Вася",
        //     age: 30
        // }

        // let user = userInfo3;
        // user.age = 45;

        // console.log(userInfo3.age);

/////////////////////////////////////////////////////////////////////////////////////////

//      Задача 4 :
//              В консоли будет вася (потому как мы сначала обьявили user, а после userInfo4 привели к null ).

        // let userInfo4 = {
        //     names: "Вася",
        //     age: 30,
        //     showInfo () {
        //         console.log(`${this.names}`);
        //     }
        // }
        // let user = userInfo4;
        // userInfo4 = null;
        // user.showInfo();
        // console.log(userInfo4);

///////////////////////////////////////////////////////////////////////////////////////////

//      Задача 5 :
//             Выведет значение  из ключей names и age.

        // let userInfo5 = {
        //     names: "Вася",
        //     age: 30,
        // }

        // for (const key in userInfo5) {
        //     const value = userInfo5[key];
        //     console.log(value);
        // }

//////////////////////////////////////////////////////////////////////////////////////////////

//      Задача 6 :
//             Выведет город (так как мы обращаемся к значению address )

        // let userInfo6 = {
        //             names: "Вася",
        //             age: 30,
        //             address: {
        //                 city: "Ужгород",
        //             }
        //         }

        //         for (const key in userInfo6.address) {
        //             console.log (userInfo6.address[key]);
        //         }

//////////////////////////////////////////////////////////////////////////////////////////////

//      Задача 7 :
//          Запись была не верна, так как в консоль нужно прописать через квадратные скобки. 


        // let userInfo7 = {
        //     names: "Вася",
        //     age: 30,
        //     "like js": true,   
        // }

        // console.log(userInfo7["like js"])

///////////////////////////////////////////////////////////////////////////////////////////////

//      Задача 8 :

        // let userInfo8 = {
        //             names: "Вася",
        //             age: 30,  
        //         }
        // userInfo8.names = "Лена";
        // console.log(userInfo8.names)
        // delete userInfo8.names;
        // console.log(userInfo8.names)

///////////////////////////////////////////////////////////////////////////////////////////////


//      Задача 9 :
//               (не совсем понял задание - ниже вывел значение, а как сделать масив не понял,
// для этого у нас и есть object.keys  и object.values)

                //  let userInfo9 = {
                //      names: "Вася",
                //      age: 30,  
                //  }

                //  for (let key in userInfo9) {
                //      console.log(userInfo9[key])
                //  }


////////////////////////////////////////////////////////////////////////////////////////////

//      Задача 10 :

                // let userInfo10 = {
                //     names: "Вася",
                //     age: 30,
                //  }


                // for (let info in userInfo10) {
                //     console.log(info);
                //   }

////////////////////////////////////////////////////////////////////////////////////////
                
//      Задача 10 :

let a = {names : "Danil"}
let b = {names : "Danil"}
function home () {
        
        for(let key in a) {
            if(a[key] !== b[key]) {
                return false;
                    }
                }
                return true;
}
console.log(home());

// console.log(JSON.stringify(domHome) === JSON.stringify(domHome2)); 
